#include <iostream>
#include <decaysum.h>

using namespace std;

int main()
{
    {
        RainAtt rain;

        DecaySum::StaticData test1{
            30,
            30,//大气温度
            1.5,//大气湿度
            1017,//压强
            2,//雨区数量
            {4.0,7.0},//每个雨区降雨率
            {{23.0855,120.3437,159.7240,23.1213,120.4413,4208.3}
                                            ,{23.1237,120.3704,194.4921,23.1460,120.4289,3226.4}},//每个雨区左下与右上角经纬高
            2,//雪区数量

            {1,2},//每个雪区降雪率
            {{23.0116,120.3223,105.5236,23.0473,120.4198,6145.5}
                                            ,{23.0498,120.3490,133.8956,23.081,120.4074,5167.3}},//每个雪区左下与右上角经纬高
            1,//雾区数量
            {1.8},//每个雾区降雨率
            {{23.1478,120.3545,213.0906,23.1656,120.4521,2750.6}},//每个雾区左下与右上角经纬高
            2,//云区数量
            {3.0,4.0},//每个云区含水量
            {{22.6665,120.2520,7000.6,23.1948,120.4333,9273.6},
                                             {22.6665,120.2520,10001.0,23.1947,120.4333,11274.0}},//每个云区左下与右上角经纬高
            1,//霾区数量
            {1},//每个霾区污染程度
            {{23.1664,120.3776,233.7128,23.1888,120.4361,2268.2}}//每个霾区左下与右上角经纬高
        };

        DecaySum::DynamicData test2{
            1,//仿真帧起始时间
            2,//仿真帧结束时间
            1,//数据有效性
            "s1",//衰减模型ID
            1,//单双路径
            "s2",//信源ID
            1,//信源状态
            "s3",//信宿ID
            1,//信宿状态
            12000000000,     //频率
            120.2714,//信源经度22.69,120.29,20000.0
            22.77457,//信源纬度
            20007.0,//信源高度
            1,//信源极化方式
            0.2,//雷达天线增益
            120.414,//信宿经度23.177,120.414,251.617
            23.177,//信宿纬度
            251.617,//信宿高度
            1,//信宿极化方式
            1.4,//天线直径
            0.6//天线效率
        };
        test2.Source_State=1;
        test2.Target_State=1;


        DecaySum decay;
        DecaySum::ReturnData reD=decay.decay_sum(test1,test2);
        cout<<reD.TotalAtt<<endl;

        return 0;
    }
}
